from Diplom_bot.Config import *
from Diplom_bot.Price import *

start = (" Я бот помогающий тебе начать свой путь в мире Сноуборда")

about = ("Здесь ты можешь собрать свой комплект экипировки для катания на сноуборде. "
         "Я помогу подобрать тебе комплект снаряжения независимо от уровня твоей подготовки.")

NBotinki = (f"{ModelNBot}. Перед вами самые доступные по цене мужские ботинки 32 с системой шнуровки BOA. "
            "Это мягкие ботинки с внутренником COMFORT FIT и стелькой COMFORT, которые отлично подойдут начинающим сноубордистам для паркового катания."
            "Несмотря на заявленную мягкость, ботинки отлично фиксируют ногу. Внутренний ботинок термоформируемый с 3D языком и системой быстрой шнуровки."
            f"Данные ботинки комплектуются очень легкой и цепкой подошвой STI Evolution Foam™. Цена {priceNBot} руб.")

NKreplen = (f"{ModelNKr}.Обновлённая версия популярных лёгких и недорогих креплений Union «Flite Pro». "
            'Flite' " - сокращение от " 'F*uking Light' " - невероятно лёгкие крепления с говорящим названием."
            "Начинающим и совершенствующимся сноубордистам не нужны жёсткие крепления. "
            "Они слишком быстро передают усилие на кант, поэтому не избежать ошибок, свойственных недостаточному контролю. "
            "Данные крепления, наоборот, простят некоторые погрешности и сделают катание в целом более комфортным."
            "Union «Flite Pro» - именно такой вариант, проверенный и удобный, обеспечивающий необходимый уровень стабильности. "
            "Union Flite Pro — лёгкие и мягкие, гибкие крепления для сноуборда для фристайла, предназначенные для сноубордистов от начинающих до прогрессирующих."
            f"Идеально подходят для обучения катанию по всей горе или первых трюков в парке. Цена {priceNKr} руб.")

NSnoubord = (f" {ModelNSnow}Nidecker Play предлагает райдерам начального уровня надежную доску для быстрого прогресса из сезона в сезон."
            "Прогиб Freestyle Camrock, который имеет плоскую секцию между креплениями, и постепенно переходит в рокеры на носу и хвосте."
            "Результатом является доска, которая работает отзывчивей под вашими ногами нежели классический прогиб, - она идеально подходит для расслабленного катания по трассе или изучения ваших первых трюков."
            "Play также оснащен полностью деревянным сердечником, экструдированным скользяком и надежной конструкцией, поэтому он легко стерпит неизбежные удары."
            f"Идеальный компаньон в любом снежном путешествии.Цена {priceNSnow} руб.")

MBot_Park = (f" {ModelMBot_Park} Сноубордические ботинки Anthem для тех, кто ищет качество во всем."
             f" Если вы из тех райдеров, которые любят кататься по рэйлам и трамплинам в парке и не прочь пойти бэккантри в горах, они вам понравятся."
             f" Комфортный термоформуемый внутренник Cloud 4 способен формоваться даже от тепла ног после нескольких дней катания. "
             f"Отдельное внимание уделено простоте снятия ботинка. С технологией Bail Out ослабить шнуровку и снять ботинок можно за считанные секунды. Цена {priceMBot_Park} руб.")

MKr_Park = (f" {ModelMKr_Park} Сноубордические крепления TEAM - выбор большинства райдеров команды Nitro. Легкая композитная база STEALTH AIR с алюминиевым хилкэпом и кантингом базы в 3 градуса обеспечивает правильную эргономичную поддержку стопы."
            " Зарекомендовавшая себя крепежная система Mini Disc со своими малыми размерами уменьшает мертвую зону в области контакта болтов с доской, обеспечивая более точную отдачу. "
            "Амортизирующие подушки DUAL AIR эффективно рассеивают ударные нагрузки от приземлений. Алюминиевые бакли и ремешки с тросом из нержавеющей стали гарантируют долговечность даже при самом жёстком катании. "
            "Асимметричный хайбэк, объемная верхняя стрэпа Premium Hold и нижняя стрэпа UBERGRIP от VIbram™ крепко держат ногу. Цена {priceMKr_Park} руб."
            f"Крепления TEAM это комфорт, жесткость и максимальный контроль. Цена {priceMKr_Park} руб. ")

MSnow_Park = (f" {ModelMSnow_Park} Сноуборд Cinema с формой Directional Twin создан для плавного и не требующего усилий катания от трассового вельвета до парка. "
              "Модель чувствуется мягкой и приятной на спуске, благодаря гибридному прогибу Gullwing Rocker и парковому флексу. "
              f" Скользящая поверхность Premium Extruded FH очень прочная и неприхотливая в обслуживании. Цена {priceMSnow_Park} руб.")

MBot_Freeride = (f" {ModelMBot_Freeride} Сноубордические ботинки Nitro Skylab преследуют только две цели – быть самыми легкими сплитбординг ботинками на рынке и превосходной олмаунтин моделью на каждый день. Цена {priceMBot_Freeride} руб.")

MKr_Freeride = (f" {ModelMKr_Freeride} Технологичные крепления Supersport для тех спортсменов, чьё катание переполнено большими нагрузками и скоростями."
                " Комфорт и точность достигается благодаря жесткому анатомичному хайбэку Biomap Composite Carbon из поликарбоната, "
                "комфортным и объемным верхним стрэпам Grand Royal с магниевыми баклями Mg12, обновленной легкой композитной базе Lightsaber с кантингом для максимально естественной стойки во время катания. "
                "Технология стальных пружин Eazy-Entry на коннекторах верхних стрэп облегчает жизнь райдера, позволяя облегчить процесс встегивания и выстегивания. "
                f"Нижние стрэпы из резины двойной жесткости. Такой компаунд обеспечивает комфорт и надежное прилегание. Цена {priceMKr_Freeride} руб.")

MSnow_Freeride = (f" {ModelMSnow_Freeride} NITRO BANKER - THE ORIGINAL TURNING & BURNING CHAMPION. Сноуборд Banker из линейки Quiver это жесткая и отзывчивая модель с направленной формой Directional и классическим прогибом True Camber. "
                  "Эта доска идеальна для больших скоростей, для крутейшего карвинга, а также для катания вне трасс. "
                  "Форма, жесткость и глубокий вырез позволяют выкатывать на крутейших рельефах на стиле и с изяществом. "
                  f"Banker это мощное оружие для покорения любых горных рельефов. Цена {priceMSnow_Freeride} руб.")

MBot_Freestyle = (f" {ModelMBot_Freestyle} Сноубордические ботинки Northwave Decade предназначены для фристайла и фрирайда. "
                  "Технологии и вид, как у спортивного авто: с новой подошвой, новым улучшенным язычком и обновленным внутренним сапожком."
                  "Внутренний сапожок SENDER PRO из термоформуемой пены - наиболее комфортный в линейке."
                  "Прилегающие зоны внутренника обладают эффектом памяти формы. Все знают как важна четкая фиксация пятки без болтания и люфта во время катания. "
                  f"Подошва STOMPER PRO с ударопоглощающей пеной в пяточной части обеспечивает отличную амортизацию и необходимое сцепление на скользких поверхностях. Цена {priceMBot_Park} руб.")

MKr_Freestyle = (f" {ModelMKr_Freestyle} A-4 - это главный фундамент алюминиевой линейки Ride. Эти крепления - идеальный выбор для прогрессирующих райдеров, которые хотят выйти на новый уровень мастерства. Цена {priceMKr_Park} руб.")

MSnow_Freestyle = (f" {ModelMSnow_Freestyle} Модель URBAN это доска с мягким флексом, высокой прочностью и отличным щелчком. "
                   "Снаряд для фристайла и мощного джиббинга симметричной формы TWIN и прогибом Skate Camber с максимально широкой плоской частью и двумя кэмберными зонами в передней и задней части доски."
                   "У доски облегченный сердечник из тополя с усиленными композитными боковыми стенки UR'INSANE, которые обеспечивают эффективное поглощение вибраций и ударов. "
                   f"Экструдированная скользящая база высокой плотности неприхотлива в обслуживании и легко чинится. Цена {priceMSnow_Freestyle} руб.")

ProBot_Park = (f" {ModelProBot_Park} Универсальные ботинки для сноубордистов с высоким уровнем катания. Удобная модель с облегченной подошвой для максимально комфортного катания. Версия wide для широкой стопы. Цена {priceProBot_Park} руб.")

ProKr_Park = (f" {ModelProKr_Park} Флагманская модель коллекции и любимая командой райдеров. "
                "Ultra демонстрирует полный арсенал высококлассных технологий Union. "
                "Чтобы это действительно прочувствовать, нужно просто прокатиться на Ultra, - на самых удобных креплениях для сноуборда. "
                "Они обеспечивают ощущение мягкой езды, которого вы никогда раньше не испытывали. "
                "Каждый компонент Ultra действует как система подвески для ваших сноубордических ботинок, загружая и разгружая их при каждом движении во время езды. "
                f"Добро пожаловать в будущее дизайна креплений для сноуборда! Цена {priceProKr_Park} руб.")

ProSnow_Park = (f" {ModelMSnow_Park} Jones Frontier - это универсальная доска с акцентом во фрирайд, созданная для того, чтобы стать универсальным повседневным сноубордом с игривым характером."
                f" Благодаря плавучему фрирайдному носу, сочетающемуся с фристайловым хвостом, Frontier идеально подходит для снежных дней, дней в парке и любого дня между ними. Цена {priceMSnow_Park} руб.")

ProBot_Freeride = (f" {ModelProBot_Freeride} Жесткие ботинки для фрирайда. То что нужно для продвинутых сноубордистов! Ботинки чутко реагируют на малейшее движение ногой и дарят максимальный контроль на доской. Цена {priceProBot_Freeride} руб.")

ProKr_Freeride = (f" {ModelProKr_Freeride} Сноуборд крепления Nidecker Supermatic — это то, чего так ждали сноубордисты: "
                  "первое универсальное автоматическое крепление с двойной системой встёгивания. "
                  "Supermatic работает с помощью откидывающегося хайбека  'Drop In tech'. "
                  "Удобный рычаг разблокировки делает выход таким же быстрым. "
                  "Чтобы каждый раз наслаждаться идеальной посадкой, просто один раз настройте их, а затем зафиксируйте стрепы с помощью алюминиевых фиксаторов."
                  f" Прелесть этой системы в том, что она работает с ботинками любого производителя, и в ней нет сложного механизма, который может забиться.. Цена {priceProKr_Freeride} руб.")

ProSnow_Freeride = (f" {ModelProSnow_Freeride} Идеальная доска на каждый день. Доска очень фановая. Подходит как для трасс, так и для выездов в паудер. "
                    f"Такую можно назвать - универсальная доска для курорта. Цена {priceProSnow_Freeride} руб.")

ProBot_Freestyle = (f" {ModelMBot_Freestyle}Ботинки Deeluxe — отличный выбор для фристайла. Средняя жесткость, цепкая подошва и отличная амортизация — вот отличительные особенности этой модели. Цена {priceMBot_Park} руб.")

ProKr_Freestyle = (f" {ModelProKr_Freestyle} Сноуборд крепления Jones Mercury разработаны для опытных фристайлеров, которым нужны чрезвычайно удобные, манёвренные и отзывчивые крепления."
                    "Крепление будет мгновенно реагировать на каждое ваше движение благодаря технологии SKATETECH, которая передает вашу энергию прямо на канты."
                    "Хайбек Mercury Control Flex обеспечивает надежную поддержку, поглощая лишние вибрации."
                    "Широкая нижняя часть ремня Power Spine Ankle Strap мягче для повышенного комфорта, а центральная часть более жесткая для максимального отклика."
                    f"Mercury оснащен низкопрофильными ремешками 3D Flex Fit 2.0, которые слегка растягиваются, чтобы соответствовать любой форме ботинка. Цена {priceProKr_Park} руб.")

ProSnow_Freestyle = (f" {ModelProSnow_Freestyle} Еще одна обновленная в сезоне 20/21 про-модель JESSE BURTNER - парковая твин-тип доска с сердечником OP. "
                     "Несмотря на одинаковый сердечник, она жестче, чем BOX SCRATCHER и у нее кэмберный прогиб C3. "
                     "Сочетание прогиба C3 и True-Twin геометрии отличный вариант для получения максимального фана от джиббинга. "
                     f"А легендарная Magne-Traction позволит не терять контроль над доской даже на обледенелых участках склона Цена {priceProSnow_Freestyle} руб.")

other = "Не знаете что выбрать - приходите в наш магазин. Наши консультанты всегда готовы помочь с выбором."